In [ ]:
import pandas as pd

In [ ]:
'''Create a DataFrame sales_data with columns Month,Product,Sales, perform the following operations::9;Mon9;:9;J99;F99;M99;J99;F99;M9;39;Prod39;333333B,33B,B39#39;S#39;: [150, 200, 250, 300, 400, '''500]

In [51]:
sales_data=pd.DataFrame({'Month':['Jan', 'Feb', 'Mar','Jan','Feb','Mar'],'Product':['A','A','A','B','B','B'],'Sales':[150, 200, 250, 300, 400, 500]})
sales_data

  Month Product  Sales
0   Jan       A    150
1   Feb       A    200
2   Mar       A    250
3   Jan       B    300
4   Feb       B    400
5   Mar       B    500

In [49]:
#Group the data by &#39;Product&#39; and calculate the total &#39;Sales&#39; for each product.
df1=sales_data.groupby('Product')['Sales'].sum()
df1

Product
A     600
B    1200
Name: Sales, dtype: int64

In [63]:
#Find the month with the highest sales for each product.
sales_data.loc[sales_data.groupby('Product')['Month'].idxmax()]

  Month Product  Sales
2   Mar       A    250
5   Mar       B    500

In [43]:
#Add a new column Sales_Percentage which represents the percentage contribution of each sale to the total sales of that product.
sales_data['Sales_Percentage']=(sales_data['Sales']/sales_data['Sales'].sum())*100
sales_data

  Month Product  Sales  Sales_Percentage
0   Jan       A    150          8.333333
1   Feb       A    200         11.111111
2   Mar       A    250         13.888889
3   Jan       B    300         16.666667
4   Feb       B    400         22.222222
5   Mar       B    500         27.777778

In [ ]:
'''Create a DataFrame employee_data with the following data:
Name: [&#39;John&#39;, &#39;Doe&#39;, &#39;Jane&#39;, &#39;Anna&#39;, &#39;Smith&#39;]
Department: [&#39;HR&#39;, &#39;Finance&#39;, None, &#39;IT&#39;, &#39;HR&#39;]
Salary: [50000, 60000, 55000, None, 58000]'''

In [29]:
employee_data=pd.DataFrame({'Name':['John','Doe','Jane','Anna','Smith'],'Department':['HR','Finance',None,'IT','HR'],'Salary':[50000, 60000, 55000, None, 58000]})
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane       None  55000.0
3   Anna         IT      NaN
4  Smith         HR  58000.0

In [31]:
#Identify and count the number of missing values in each column.
employee_data.isnull().sum()

Name          0
Department    1
Salary        1
dtype: int64

In [79]:
#Fill the missing values in the &#39;Department&#39; column with the mode of the column.
employee_data['Department']=employee_data['Department'].fillna(employee_data['Department'].mode()[0])
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [69]:
#Fill the missing values in the &#39;Salary&#39; column with the mean of the column.
employee_data['Salary']=employee_data['Salary'].fillna(employee_data['Salary'].mean())
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [71]:
#Drop any rows that still contain missing values.
employee_data=employee_data.dropna()
employee_data

    Name Department   Salary
0   John         HR  50000.0
1    Doe    Finance  60000.0
2   Jane         HR  55000.0
3   Anna         IT  55750.0
4  Smith         HR  58000.0

In [85]:
#Create a Series temperature with the following data:
#[23, 21, 20, 25, 27, 30, 28, 22, 24, 26]
temperature=pd.Series([23, 21, 20, 25, 27, 30, 28, 22, 24, 26])
temperature

0    23
1    21
2    20
3    25
4    27
5    30
6    28
7    22
8    24
9    26
dtype: int64

In [ ]:
#Calculate the mean, median, and standard deviation of the series.

In [87]:
temperature.mean()

24.6

In [89]:
temperature.median()

24.5

In [91]:
temperature.std()

3.204163957519444

In [113]:
#Create a new Series temperature_celsius that converts the temperature from Fahrenheit to Celsius
temperature_celsius=pd.Series((temperature-32)*5/9)
temperature_celsius

0   -5.000000
1   -6.111111
2   -6.666667
3   -3.888889
4   -2.777778
5   -1.111111
6   -2.222222
7   -5.555556
8   -4.444444
9   -3.333333
dtype: float64

In [ ]:
#Find the index of the maximum and minimum values in the original temperature series.

In [99]:
temperature.idxmin()

2

In [101]:
temperature.idxmax()

5

In [105]:
#Sort the Series in ascending and descending order.
temperature.sort_values()

2    20
1    21
7    22
0    23
8    24
3    25
9    26
4    27
6    28
5    30
dtype: int64

In [107]:
temperature.sort_values(ascending=False)

5    30
6    28
4    27
9    26
3    25
8    24
0    23
7    22
1    21
2    20
dtype: int64